#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "fb9a21955955340433e7a6e68e4c5f8b" -> "0454363ea1e30b9ffe20c65897797324"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "dca0a5c3f39414d663e11c4eea965160" -> "216ecfae3bd55c26491ee66d48e34349"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "7a7d756ad9caf9d90bdc6191d6c8d9a4" -> "f7007c5b0c146fe7cda212171401fc14"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "eabae933674289a17277f4a5f71bb2cf" -> "104ffa312a58e5dc8387fb8b77b4d0fb"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "8b7851fe584c965a95bc17f32e99d2c4" -> "602dbc2d6e21967ec2a8e68f7c8a81e6"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "ccc7e03859c1a8435585c371fc78e572" -> "3a32ccabf5925a2bfc2d579c1c7c6287"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "ca322ad0c6b063003c350f3bdd003c5e" -> "6dffa048c02aafcac5e2dcf5b158e97f"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "d6da783268329937a8246c0fbb26b570" -> "c10c4317b4ffaca230c191e9476fc0fc"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "3b2ffce69a445b2202612267ae38acba" -> "f705244b77084f991e1bef48a24ab1bc"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "019f0171f4dad4dfb44f043fa630780f" -> "715cffcbd64985092cac43952bf8850f"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "6b4bc374572ab1871384ebdbcb50c09c" -> "ba9bcfd75c1542793789ade3bef26b8b"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "16d0a4447ad9a110f5d8c25b4ea75d70" -> "d29c219f9adfced80586e8aaeb6dabc7"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "371b80326081d714e4d583960cc3694a" -> "90171dd029ac9399b58aecffeb6d3225"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "6df4f0badac9a132dceeb0c5e321c084" -> "bac73f410a094fd16435a14a04535e1e"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "88953cd7fa71853f0a1f796862d1b7ad" -> "1b701fca66a3b925814b42be371eaa6c"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "788213f13ae04c3ed0d8255c189dab03" -> "56120891b40b829f2e1c72b26e2abb3a"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "83a2c17a5db407626e62f8fe79971305" -> "ef689dc5a942549d2f98c913c3a7fae3"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "2cfbd7c997baf1ed4b2c3f0c4ebe1d9d" -> "9f93183a03d001e36a3862977d1a6d80"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "c0bf3852779f600488e59016e1b91827" -> "e91443d756955f5a9f25cc77d771e839"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "f48a358123199eda487e3358c2ebd33e" -> "b049af0052fd44ca72c43ad3fa76591e"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "4947a15f73c76b979947595ea8b87910" -> "edb8c514e34b94c7f1bb8a6a4362e456"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "67e09c4aa3b027a44aa3b8da40bc81a8" -> "83aff0b841b28ff44411b2d6905493bb"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "3a75d15a75d815cb9e56b63ccc9b0f08" -> "a76abb20de95993bc3fbe941aba64090"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "11172830de972698a76353c0987276eb" -> "54db01cca1d36e605d7cdaa6ac6664fa"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "abd961b59c4f909b40d35de34c66edb1" -> "d4a60fc9e3ab6558263ec3e8d641adf9"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "010755e966d1587a816cf4856cee4d50" -> "3af7dc3a4c2d28cd30cdc6ec0707dd98"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "e723ef7a0d2397f2b62e2e8849b0a520" -> "92e7eca0f2a99d8def1ce78f62498941"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "acacef2e95471114968c65d982ef6296" -> "88cab4b6385310b4c881c71fd6fe8ce7"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "9718042aee49707d22b5eaee1d1f0fd1" -> "255f07535c2517e44b9ea43851596970"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "3dfeab827d541fc6f2244b3842845eb3" -> "d307b43d8cca30a12cca26ee20639a5d"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "e1a1cd7a8367205e6945b523c01ecda3" -> "051f2ea31825021d3a6c6b8cfc32a5df"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "1f8b9a23160a7f00d2df2bb5d8887c5c" -> "74ada8d66383dbe44aaf948b8195f1f2"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "4d3de9694fe5eb60f727f8356961a7c7" -> "11e873488cf307946f3e12cb989d0fcd"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "b4edd68e7d4c8912ea4dd7e44c185474" -> "81550ded488c8527a1ab6c8f3a756485"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "ef9d151dd783de51ffc53380c26ab132" -> "13b0216fe1b4a600e775ffa5abf1879c"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "a5fcdfc22c2157f1ba7e6c359537ae41" -> "e5be89a67acae710399ea37f0bb6443c"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "03c036cb1a5fcaf7cd9e27032117cf9a" -> "07df9839e499a6a42d6df91ffcfe1e7d"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "49b7b8a2937b714d902be3fa7c8d5b98" -> "1db42633d1ce7346cbd51fee7c35508d"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "b2e2b68bf28d646b4b2b07e98779dedb" -> "aa6ec6ec264f68a9a853a378a4afbc07"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "08a9a1182ceb928d45040e2971c4ecdf" -> "3e389211dbdaf4176428322d2e9b0958"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "4f91bf158cfa4edf2a37e39ae73c496c" -> "5bee98b24a65b8e31fde96a37a2d486a"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "2c417d6d06ac9db0ae7c146b57d99e5c" -> "f6716bf40d5006539075dad5eca870e2"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "497a79663e1330c5893314a35b4373a6" -> "f46be3c0718210c39d694ac08c358861"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "9f11faa0e518eaf12c6c1b86b3c0ef5a" -> "19d83c02912119861de4d9ef1accea39"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "7e0ebca09b6914440083bfd4a801005b" -> "ab0b1e00a00b9e78120e2c93cc5e6d69"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "c99b79bb53b3fe5392bef5ad943d3fe8" -> "3e6e9ec23cf7be5aa8ba30dabe49749b"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "467b5ff3bfd55a50fe4fe11d41a1e7ba" -> "30078db5bc5491e14733e7037a842a9a"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "G9GJDqQ5atZEWyPObXzqKW/25xCyJAHhOyUQKBr3yVs=" -> "Esqoz0BMi4wl2t9cNDHi/SuvXS6hwmhed8OGjqUXRdo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "M3x9hejPGz2eKjpQ9VDr+/IG6XbcJmOueDKP0GHhmi4=" -> "jvKHJIPHwd2zxBCZS0bTDuoevSFpvWNOLlos8Yg8NOw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "p45wJK+65XnjbsJyWbHBrO3tjU7NIPfOOXBYn6c0zDA=" -> "XRXlFV42DBCu7G9+OS9s97iTCSk34IsTfUe13YFVdac="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "vv+SAyWIplTdO46UFT2hi8DdKPXO4CgZpTeFsj35RGY=" -> "ND+mRqYV07Jdlc0p9tePOKWe1Zf6ifH8xIxvoZkKv8E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "i2EScjLut5rid6yYSfOUzsgF9MSd0duMeGOS+qjsmeE=" -> "I7dHZfL1argLxeI/Zncs86zmST0l9rvCBuDa9jAf500="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "B/o8Ur6sXrGORVIQXQQN7LWTovalcOcXxNswPNjI93Q=" -> "mnTCmsgw1nAlIwpWwxoFJ9WK7SXNIyRatH73hoR5lG8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "9y61roCQUuh/RmKL0rHxEa/RfX4GTRv539My+xkOg/M=" -> "Xijt1uuDNRYaHYNdQVg45Wmth4wHt9DxNIfSssocY3s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "QVA03Gu0Grc0Rl6wTLP/ijfqZMyNao/hwjytNrryzE0=" -> "az6dre0iMLSpIRLNBco2s197Ud8fmVJmpI/kxRFsnzU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "hS+GpOChq5qKjFiJlAqdxRhC/cZPUXGETAsLCO403i4=" -> "M1Wt7jZghyzvrJXibu1/LDOYybEQ+RcIUweAJNqkkFM="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "+LOLg12ZxbHltwiAWCnTH02m2NmLl21rLKJljE0QkJU=" -> "yG+toeCz7cgcldRx2Jlb13omQatsDitCdaOYgq4gIQ0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "pWa+x6oaElN23qNoB10oAa/MgixybEJTgvtbeAwUiU0=" -> "+8pVXTQissWQoxoX8efyOdSnVslzzHsPvY3ojDjdgCk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "PVz4qVdpftjcpp5bQvuYDitvThGe83Uk4o9VnixXlw8=" -> "nVGouq3eosN/cZ7Pg3POf7gPWrhjmIiOCD0Kd4lhCo0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "TQ8Z57ibxqCui01ceHrG0/zWvrJxF9GVG32V/qLbOKw=" -> "Vft/aquKzEXa5J+doZjHHCkcwQtQqiXPCvjv4rvvsS8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZgZGdAFjb5NYzKgTiJchuNAIZA3yKrOI4RL0MKow2To=" -> "74E8ycah7qPt7qi0HU4r6nOVuxCOvAs/TYtLEDwca9A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "bETO9Yc9dU102VM8g7WfbxPDJupStp9ZDRv/5funSNU=" -> "gtYOmr6ysT+BaVBbaCS7xdX4h+/5FivnIPN8huStG1M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "bAFhsuK65mVozEpCDwVwLg2Umo4NmBuTGjV1tTDl4mg=" -> "SByyz9AjS+3Dv+iKutccySaFxRnmlcfSVpQAvPBU9yg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "fooHfiKAkpzUr2vmMfX8hO+ddioAdEVhbtofNMIUjGs=" -> "BUwlTAoqBR3pPktmQY2t0LL7bnHFsbwyZr3re1wmVpQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "0Fgcd4EZRAK1tVpsdGMxzzeiIi5k950XoaoUt4kOwrw=" -> "v5uJsmMSS6XTB6Dvqkn0pZ2L36FuZ0ApIMMiQyhhDe8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "j8v20xnYWliiwE6Kq1cT4Hij/5U7dHZKJ9M3X5JGqrc=" -> "TE9SQRAp+QLZzMwUg5g9/OcjmP4g/nwZ30BrbBbx8/w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "FzDO9xV27j2i89pkrFe2H2Lml+TFiK/0iDcdKgYYJqU=" -> "QkPiIXwuphanmZ5qUhQ4sAFxMOBkUUsLjV5/9Eu7UuE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "e5MZB4/xjWzWjAj7FnOBCmyfcAAnx2pb0pC8PFO9LUA=" -> "MrVyNLJYkXcgsY+Y4+oF9icjHPC0YJ8jSPyXdY8w24Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "BWNqTSigFJgLi5pVh2ajV5dC0F5nhP4vXkIDKdDSa2E=" -> "gnFIM2N8t5sZvh34yydyE2cvaKGHDQz7NndOI4J5iBQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "37i8EZBHY7cMgK/S8nUNqvLJNJJKuMoOxcWjVzbCy7k=" -> "VaE/qmdBEn3mQeHhpgBOMG938v2wgheagEqEPQcLVcA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "nTfvqdI1xIZlEkMBWQ1JQZ/D1tXd93P3+b1JBcifOxQ=" -> "BLdtkyJ2q8MSJbJM/zOjFKslyGAGt2LmkgGbzutbzuk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "eh0/MTojkr9FSf/yDk4oD40v5pVE8zbXtC+Wp+ERkgs=" -> "X7Hw7Q8qRffXNh1NweNzQm1bgsGxj6PqbjB50gyAyGU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "bjk4vhDL39Z/BbPLbFAhIrr6Y14plXEaSPCAPU2gg+I=" -> "T+Nm+EF62Ybchkh895YQevRrppyhOdM5nHg4jLPEKYM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "O8XbhKIvWtMf3myIWnsbPOP2QGWLXCBtge/vDpDexas=" -> "hRUPu9swmdeeBlGC9i6+xcK1hWmC0tyqszd4xvz/nAA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "CY3BvmSSkhQXRPxPWVuH6aS2s7u0FT5w927Hm21CHSs=" -> "I2PKcQYz/OVR3enzhfCF3vZqhJYh3snlOHv2UfnbOLA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-25T06:08:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "tHzWG/Sr/2QXiYgHWFkMSyqsalO15ecK9CQSt3xIP/A=" -> "pmklBBpBWWUlo3gycnyN+5mR1rEaUmprCz9ehm+QH/o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "r34YO9Vrsd43DI5DWAkFJbTPmjSzqPJMJi0X2BV3ncI=" -> "8ZsEXiCwM07luPw+itAHT7dbnDDMUZMNSjWEQTQp5sc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "8ot31e5Pf1kgNfSRIvOyzaZ7+/q4WQWWgoxf60W2yEI=" -> "RQgaRusZeRAaRo+jsSQMjWQkEmJGB40jLxaHgnfuXEU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "zxX8HHNJXT00DkaQ21phoVxklHHZN7HwOHLYNUHO0DI=" -> "O/7l6bdqP0HEWzut6AYKjEIdhIYeM/bnO5Dn0g6AONY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "gFtc5dDRnxE4IMtc4gm35q/IoyEMP+Uerd5Cwr1PBbo=" -> "XIbT827AlNoGl2dq+OGLiVxEcbe/+alk3uG4J1s64HE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "y/uJWjl+qa+CWBYv5pAude4FZIcsN1udVR4dILFsUnA=" -> "3ruGNFluKtU+dTFOdXlekMcsmoPzyGvW3AtsC9UScRQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "D7sZ5A6sbnrnVVqFXbX5i9yv1ACEJ119E2SdFc54HWI=" -> "ApgEwHqSyoSXTevEx87FdxLNxHNY3gEHpRZ+nzcXRAU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "HoBtGuniuD4lSCbIhuopPX8RAxKm/ouvqLLNt1ixsPk=" -> "uDzL2s+c0kIWom6RCFLKKa4zb7hO6KNnXzTpnG1h32s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "i1jIFCDDKkHij+hIs3/BMI+UvmnlA1diL4zJVftydEo=" -> "nHefbPdhRTcOlAqvP07AbqJb1mZJu/Ci+vg0e38/HCk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "ArH33zmoOgqmKIcXHSgE5meYEo3XAbtWj5s8oO+IyLQ=" -> "6UOXMS+PerNPWDLgNqKr6eOkpxKc4Xb4kkNzm9KWcZc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "skO1g9fGQd+AiraBryPGus5+J3B6St22VTuGc3bgfM0=" -> "b8nGkG4kKDh60uqEy19UBrotsQJz1a+yOBM81iHw75o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "pamSCi/fF+YMBB17pW2gi1hP4iZJQ1eKA52Cbab7lIE=" -> "xc6EdIAbS0P0+b7cz9Nrv72d9/Z7J7GoJwzjGSzVxrM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "xQbgwhVwRPY5+v58hyh/h7H3n8syn3S3QKogAQ4Gx4Y=" -> "XFoRJmi4ig2IIhnz+md0h4Lv+RC5ig285QgON9cjFv4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "fAwUnhoswBtk59WTXtPFQ2rGsP7TrEEEFC9PA2c5yMY=" -> "AlvpwZ6FX46Abm30lZ5cM0MQ0AslfOoIenLoVTPwWWU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "v5VswIOFkJKz6ugj4IO8YA+YmbB6jiU4g1M1l8LO98A=" -> "FFbkwPdksuAXmwT+To4Oo1FXZjQ1VwMMOB4dvVzhJaY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "ryaDIxe22WsaYQkmWilEtoL9+1A2LqyWRzpXBdIWvGw=" -> "ciGbJST6j3z5S3P9MF4OL3o7hAm4YjNa0hnNZ2vbZvc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q6wsI2edREFbsl9HXdQlX3QzwP0urQKtgL0NlhPruDk=" -> "z1OBIh/23c6r7Ova5O6Fu58WIABobzcRlWF5XXkh050="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-24T18:59:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "g32KTdFvjdWX2H0poM8qQ12VErO9OE7j/FXW9SimTLo=" -> "SLuF3ojGYY27f9ypKcqV88LNkvQwcrlwFlwMA47uM70="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-24T18:59:12Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "xb74g7" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-24T18:59:11Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-24T18:59:11Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*